src/Reports/ОтчётПоИзменениямВСпецификациях/ОтчётПоИзменениямВСпецификациях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчётПоИзменениямВСпецификациях</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсяСпецификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/АналогиНормРасходов/АналогиНормРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналогиНормРасходов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.НормыРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналогНормыРасходов</name>
    <type>
      <types>CatalogRef.АналогиНормРасходов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/МаршрутнаяКарта/МаршрутнаяКарта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаршрутнаяКарта</name>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <basedOn>Document.РемонтнаяКарта</basedOn>
  <basedOn>Document.СписаниеМПЗПрочее</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.ПланыВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиВПроизводство</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РемонтнаяКарта</types>
      <types>DocumentRef.СписаниеМПЗПрочее</types>
      <types>DocumentRef.ЗаявкаОтПокупателя</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОчереди</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейкаИнициатор</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияПотребитель</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Счёт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ремонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПредполагаемогоОкончанияОстановки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторОстановки</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>МПЗОстановки</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОстановки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтандартныйКомментарий</name>
    <type>
      <types>CatalogRef.СтандартныеКомментарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаРасходов</name>
      <type>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналогНормыРасходов</name>
      <type>
        <types>CatalogRef.АналогиНормРасходов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехОперации</name>
    <attributes>
      <name>ТехОперация</name>
      <type>
        <types>CatalogRef.ТехОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Остановки</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияПредполагаемая</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.ПричиныОстановок</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Инициатор</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаЛинеек</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/НормыРасходов/НормыРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НормыРасходов</name>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.Материалы</owners>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЭлемента</name>
    <type>
      <types>EnumRef.ВидыЭлементовНормРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ТехОснастка</types>
      <types>CatalogRef.Документация</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ТехОперации</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Позиция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корневой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Reports/ОтчётПоИзменениямВСпецификациях/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Отчет.ВсяСпецификация = Истина;
	Если Параметры.Свойство("Спецификация") Тогда
	Отчет.Спецификация = Параметры.Спецификация;
	ЭтаФорма.Заголовок = "Спецификация "+СокрЛП(Отчет.Спецификация.Наименование);
	СформироватьНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КлючУникальности = Новый УникальныйИдентификатор();
КонецПроцедуры

&НаСервере
Процедура ВывестиАналоги(НормаРасхода)
ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблАналог = Макет.ПолучитьОбласть("Аналог");
	
ТабДок.НачатьГруппуСтрок("Аналоги",Истина);
АналогиНормРасх = Справочники.АналогиНормРасходов.Выбрать(,НормаРасхода);
	Пока АналогиНормРасх.Следующий() Цикл
	НормыАНР = РегистрыСведений.АналогиНормРасходов.Выбрать(Отчет.Период.ДатаНачала,Отчет.Период.ДатаОкончания,Новый Структура("АнаолгНормыРасходов",АналогиНормРасх.Ссылка));
		Пока НормыАНР.Следующий() Цикл
		ОблАналог.Параметры.Статус = ПолучитьСтатус(АналогиНормРасх.Элемент);
		ОблАналог.Параметры.Наименование = СокрЛП(АналогиНормРасх.Элемент.Наименование);
		ОблАналог.Параметры.МПЗ = АналогиНормРасх.Элемент;
		ОблАналог.Параметры.ДатаС = Формат(НормыАНР.Период,"ДФ=dd.MM.yyyy");
		ОблАналог.Параметры.Количество = НормыАНР.Норма;
		ОблАналог.Параметры.ЕдиницаИзмерения = СокрЛП(АналогиНормРасх.Элемент.ОсновнаяЕдиницаИзмерения.Наименование);
		ТекОбл = ТабДок.Вывести(ОблАналог);
			Если НормыАНР.Норма = 0 Тогда
			ТабДок.Область(ТекОбл.Верх, 1, ТекОбл.Низ, 6).ЦветТекста = WebЦвета.Красный;
			ТабДок.Область(ТекОбл.Верх, 1, ТекОбл.Низ, 6).Шрифт = Новый Шрифт(,,,,,Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
ТабДок.ЗакончитьГруппуСтрок();
КонецПроцедуры

&НаСервере
Процедура РаскрытьНаМПЗ(ЭтапСпецификации,Позиция)
ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблЭтап = Макет.ПолучитьОбласть("Этап");
ОблМПЗ = Макет.ПолучитьОбласть("МПЗ");

флВыведен = Ложь;

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	НормыРасходов.Элемент КАК Элемент,
	|	НормыРасходов.Ссылка КАК Ссылка,
	|	НормыРасходов.Позиция КАК Позиция
	|ИЗ
	|	Справочник.НормыРасходов КАК НормыРасходов
	|ГДЕ
	|	НормыРасходов.Владелец = &Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	Позиция,
	|	НормыРасходов.Элемент.Наименование";
Запрос.УстановитьПараметр("Владелец", ЭтапСпецификации);
РезультатЗапроса = Запрос.Выполнить();
НормРасх = РезультатЗапроса.Выбрать();
	Пока НормРасх.Следующий() Цикл
	Нормы = РегистрыСведений.НормыРасходов.Выбрать(Отчет.Период.ДатаНачала,Отчет.Период.ДатаОкончания,Новый Структура("НормаРасходов",НормРасх.Ссылка));
		Пока Нормы.Следующий() Цикл
			Если Не флВыведен Тогда
			ОблЭтап.Параметры.Наименование = СокрЛП(ЭтапСпецификации.Наименование);
			ОблЭтап.Параметры.Статус = ПолучитьСтатус(ЭтапСпецификации);
			ОблЭтап.Параметры.ЭтапСпецификации = ЭтапСпецификации;
			ОблЭтап.Параметры.Позиция = СокрЛП(Позиция);			
			ОблЭтап.Параметры.Количество = "";
			ОблЭтап.Параметры.ЕдиницаИзмерения = СокрЛП(ЭтапСпецификации.ОсновнаяЕдиницаИзмерения.Наименование);
			ТабДок.Вывести(ОблЭтап); 
			ТабДок.НачатьГруппуСтрок("Этап спецификации",Истина);
			флВыведен = Истина;
			КонецЕсли;
		ОблМПЗ.Параметры.Наименование = СокрЛП(НормРасх.Элемент.Наименование);
		ОблМПЗ.Параметры.МПЗ = НормРасх.Элемент;		
		ОблМПЗ.Параметры.Статус = ПолучитьСтатус(НормРасх.Элемент);
		ОблМПЗ.Параметры.Позиция = СокрЛП(НормРасх.Позиция);		
		ОблМПЗ.Параметры.ДатаС = Формат(Нормы.Период,"ДФ=dd.MM.yyyy");
		ОблМПЗ.Параметры.Количество = Нормы.Норма;
			Если (ТипЗнч(НормРасх.Элемент) = Тип("СправочникСсылка.Материалы"))или
				 (ТипЗнч(НормРасх.Элемент) = Тип("СправочникСсылка.Номенклатура")) Тогда
			ОблМПЗ.Параметры.ЕдиницаИзмерения = СокрЛП(НормРасх.Элемент.ОсновнаяЕдиницаИзмерения.Наименование);
			КонецЕсли;
		ТекОбл = ТабДок.Вывести(ОблМПЗ);
			Если ТипЗнч(НормРасх.Элемент) = Тип("СправочникСсылка.Материалы") Тогда
			ВывестиАналоги(НормРасх.Ссылка);
			ИначеЕсли ТипЗнч(НормРасх.Элемент) = Тип("СправочникСсылка.Номенклатура") Тогда
			ВывестиАналоги(НормРасх.Ссылка);			
			ИначеЕсли ТипЗнч(НормРасх.Элемент) = Тип("СправочникСсылка.Документация") Тогда
		    ТабДок.Область(ТекОбл.Верх, 1, ТекОбл.Низ, 6).ЦветТекста = WebЦвета.Синий;
			ИначеЕсли ТипЗнч(НормРасх.Элемент) = Тип("СправочникСсылка.ТехОперации") Тогда
		    ТабДок.Область(ТекОбл.Верх, 1, ТекОбл.Низ, 6).ЦветТекста = WebЦвета.Коричневый;
			ИначеЕсли ТипЗнч(НормРасх.Элемент) = Тип("СправочникСсылка.ТехОснастка") Тогда
		    ТабДок.Область(ТекОбл.Верх, 1, ТекОбл.Низ, 6).ЦветТекста = WebЦвета.Коричневый;
			КонецЕсли;
				Если Нормы.Норма = 0 Тогда
				ТабДок.Область(ТекОбл.Верх, 1, ТекОбл.Низ, 6).ЦветТекста = WebЦвета.Красный;
				ТабДок.Область(ТекОбл.Верх, 1, ТекОбл.Низ, 6).Шрифт = Новый Шрифт(,,,,,Истина);
				КонецЕсли; 		
		КонецЦикла;	
			Если ТипЗнч(НормРасх.Элемент) = Тип("СправочникСсылка.Номенклатура") Тогда
			Нормы = РегистрыСведений.НормыРасходов.ПолучитьПоследнее(Отчет.Период.ДатаОкончания,Новый Структура("НормаРасходов",НормРасх.Ссылка));
				Если Нормы.Норма > 0 Тогда
				РаскрытьНаМПЗ(НормРасх.Элемент,НормРасх.Позиция);
				КонецЕсли;
			КонецЕсли;
	КонецЦикла;
		Если флВыведен Тогда
		ТабДок.ЗакончитьГруппуСтрок();	
	    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");	
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.Спецификация = Отчет.Спецификация;
ТабДок.Вывести(ОблШапка);
РаскрытьНаМПЗ(Отчет.Спецификация,"");
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 2;
КонецПроцедуры

&НаСервере
Функция ПроверитьИзменение(ЭтапСпецификации)
Результат = Ложь;	
НормРасх = Справочники.НормыРасходов.Выбрать(,ЭтапСпецификации);
	Пока НормРасх.Следующий() Цикл			
		Если НормРасх.ПометкаУдаления Тогда
		Продолжить;
		КонецЕсли;
	Нормы = РегистрыСведений.НормыРасходов.Выбрать(Отчет.Период.ДатаНачала,Отчет.Период.ДатаОкончания,Новый Структура("НормаРасходов",НормРасх.Ссылка));
	Результат = ?(Результат = Ложь,Нормы.Следующий(),Истина);
		Если ТипЗнч(НормРасх.Элемент) = Тип("СправочникСсылка.Номенклатура") Тогда
		НормыНомен = РегистрыСведений.НормыРасходов.ПолучитьПоследнее(Отчет.Период.ДатаОкончания,Новый Структура("НормаРасходов",НормРасх.Ссылка));
			Если НормыНомен.Норма > 0 Тогда
			Результат = ?(Результат = Ложь,ПроверитьИзменение(НормРасх.Элемент),Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
Возврат(Результат);
КонецФункции

&НаСервере
Процедура НайтиИзмененияНаСервере()
СписокНоменклатуры.Очистить();

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.СтатусыМПЗ.СрезПоследних(&НаДату, ) КАК СтатусыМПЗСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО СтатусыМПЗСрезПоследних.МПЗ = Номенклатура.Ссылка
	|ГДЕ
	|	Номенклатура.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И СтатусыМПЗСрезПоследних.Статус <> &Статус";
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыСпецификаций.Запрещённая);
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ПроверитьИзменение(ВыборкаДетальныеЗаписи.Ссылка) Тогда
		СписокНоменклатуры.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		КонецЕсли;
	КонецЦикла;
СписокНоменклатуры.СортироватьПоЗначению();
КонецПроцедуры

&НаСервере
Процедура НайтиИзмененияВПроизводствеНаСервере()
СписокНоменклатуры.Очистить();

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	МаршрутнаяКарта.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.МаршрутнаяКарта КАК МаршрутнаяКарта
	|ГДЕ
	|	МаршрутнаяКарта.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И МаршрутнаяКарта.Статус <> 3";
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ПроверитьИзменение(ВыборкаДетальныеЗаписи.Номенклатура) Тогда
			Если СписокНоменклатуры.НайтиПоЗначению(ВыборкаДетальныеЗаписи.Номенклатура) = Неопределено Тогда
			СписокНоменклатуры.Добавить(ВыборкаДетальныеЗаписи.Номенклатура);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
СписокНоменклатуры.СортироватьПоЗначению();
КонецПроцедуры

&НаКлиенте
Процедура НайтиИзменения(Команда)
Состояние("Обработка...",,"Поиск изменений...");
	Если ТолькоВПроизводстве Тогда
	НайтиИзмененияВПроизводствеНаСервере();	
	Иначе	
	НайтиИзмененияНаСервере();	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
Отчет.Спецификация = Элементы.СписокНоменклатуры.ТекущиеДанные.Значение;
СформироватьНаСервере();
КонецПроцедуры
